core/src/main/resources/order_template/change_language.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:oed="http://tot.co.th/totom/interface/oedata">
   <soapenv:Body>
      <oed:SubmitRequest>
         <OrderId>{3}</OrderId>
         <SourceSystemId>OMWeb</SourceSystemId>
          <OrderUserId>{4}</OrderUserId>
         <OrderDateTime>{2}</OrderDateTime>
         <OrderType>SUBMIT</OrderType>
         <OperationCode>MODSUBINFO</OperationCode>
         <OrderItems>
            <OrderItem>
               <OrderItemType>ACCESS</OrderItemType>
               <OrderItemAction>MOD</OrderItemAction>
               <OrderItemId>ACCESS{3}</OrderItemId>
               <Attributes>
                  <Attribute>
                     <Name>Language</Name>
                     <Value>{1}</Value>
                  </Attribute>                  
               </Attributes>
            </OrderItem>
            <OrderItem>
               <OrderItemType>MSISDN</OrderItemType>
               <OrderItemAction>REF</OrderItemAction>
               <OrderItemId>MSISDN{3}</OrderItemId>
               <OrderItemParentId>ACCESS{3}</OrderItemParentId>
               <Attributes>
                  <Attribute>
                     <Name>Number</Name>
                     <Value>{0}</Value>
                  </Attribute>
               </Attributes>
            </OrderItem>
         </OrderItems>         
      </oed:SubmitRequest>
   </soapenv:Body>
</soapenv:Envelope>